# Combining and Merging  Datasets

##### Join, Combine and Reshape

In [104]:
import pandas as pd
import numpy as np

In [105]:
df1=pd.DataFrame({'Student':['John','John','Adam','Smith','Adam','Adam','John'],
                  'Absentism':[10,4,5,7,3,2,6]})
df2=pd.DataFrame({'Student':['Adam','Bruce','John'],'Absentism':[0,1,2]})

In [106]:
df1

  Student  Absentism
0    John         10
1    John          4
2    Adam          5
3   Smith          7
4    Adam          3
5    Adam          2
6    John          6

In [107]:
df2

  Student  Absentism
0    Adam          0
1   Bruce          1
2    John          2

In [108]:
pd.merge(df1,df2,on='Student')# it is better to specify which column to join on, here :>  on ='Student'
# Note that merge by default take the common set (intersection) found in both table thus 'Bruce' is there in merged table.

  Student  Absentism_x  Absentism_y
0    John           10            2
1    John            4            2
2    John            6            2
3    Adam            5            0
4    Adam            3            0
5    Adam            2            0

In [109]:
pd.merge(df1,df2,on='Student',how='outer') 
# for union of both the table, key: how ='outer' is used'

  Student  Absentism_x  Absentism_y
0    John         10.0          2.0
1    John          4.0          2.0
2    John          6.0          2.0
3    Adam          5.0          0.0
4    Adam          3.0          0.0
5    Adam          2.0          0.0
6   Smith          7.0          NaN
7   Bruce          NaN          1.0

In [110]:
pd.merge(df1,df2,on='Absentism',how='inner')

  Student_x  Absentism Student_y
0      Adam          2      John

In [111]:
df3=pd.DataFrame({'Lstudent':['J','J','A','S','A','A','J'],
                  'Absentism_L':[10,4,5,7,3,2,6]})
df4=pd.DataFrame({'Rstudent':['Ap','B','Ja'],'Absentism_R':[0,1,2]})

In [112]:
df3

  Lstudent  Absentism_L
0        J           10
1        J            4
2        A            5
3        S            7
4        A            3
5        A            2
6        J            6

In [114]:
df4

  Rstudent  Absentism_R
0       Ap            0
1        B            1
2       Ja            2

In [115]:
pd.merge(df3,df4,left_on='Lstudent',right_on='Rstudent',how='outer')

  Lstudent  Absentism_L Rstudent  Absentism_R
0        J         10.0      NaN          NaN
1        J          4.0      NaN          NaN
2        J          6.0      NaN          NaN
3        A          5.0      NaN          NaN
4        A          3.0      NaN          NaN
5        A          2.0      NaN          NaN
6        S          7.0      NaN          NaN
7      NaN          NaN       Ap          0.0
8      NaN          NaN        B          1.0
9      NaN          NaN       Ja          2.0

In [116]:
df5=pd.DataFrame({'student':['John','John','Adam','Smith','Adam','Adam','John'],
                  'Absentism':[10,4,5,7,3,2,6]})
df6=pd.DataFrame({'student':['Apollo','Bryan','Jason'],'Absentism':[0,1,2]})

In [117]:
df5

  student  Absentism
0    John         10
1    John          4
2    Adam          5
3   Smith          7
4    Adam          3
5    Adam          2
6    John          6

In [118]:
df6

  student  Absentism
0  Apollo          0
1   Bryan          1
2   Jason          2

In [119]:
pd.merge(df5,df6,on='Absentism',how='outer')

  student_x  Absentism student_y
0      John         10       NaN
1      John          4       NaN
2      Adam          5       NaN
3     Smith          7       NaN
4      Adam          3       NaN
5      Adam          2     Jason
6      John          6       NaN
7       NaN          0    Apollo
8       NaN          1     Bryan

In [120]:
pd.merge(df5,df6,on='student',how='outer')

  student  Absentism_x  Absentism_y
0    John         10.0          NaN
1    John          4.0          NaN
2    John          6.0          NaN
3    Adam          5.0          NaN
4    Adam          3.0          NaN
5    Adam          2.0          NaN
6   Smith          7.0          NaN
7  Apollo          NaN          0.0
8   Bryan          NaN          1.0
9   Jason          NaN          2.0

In [17]:
#### Merging in index: In some cases, the merge keys in a DataFrame will be 
##  found in its index.
### in this case , you can pass : left_index=True  OR right_index=True or both.

In [121]:
df_l=pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(0,12,2)})
df_r=pd.DataFrame({'grou_val':[3.5,7]},index=['a','b'])

In [122]:
df_l

  key  value
0   a      0
1   b      2
2   a      4
3   a      6
4   b      8
5   c     10

In [123]:
df_r

   grou_val
a       3.5
b       7.0

In [129]:
pd.merge(df_l,df_r,left_on='key',right_index=True)  
# BY default it is intersection

  key  value  grou_val
0   a      0       3.5
2   a      4       3.5
3   a      6       3.5
1   b      2       7.0
4   b      8       7.0

In [132]:
pd.merge(df_l,df_r,left_on='key',right_index=True, how='outer')   # for union: how= 'outer'

  key  value  grou_val
0   a      0       3.5
2   a      4       3.5
3   a      6       3.5
1   b      2       7.0
4   b      8       7.0
5   c     10       NaN

# Hierarchial Indexing

In Series

In [192]:
np.random.randn(9)

array([-0.29219606, -0.27523625,  0.49069448,  0.37048371,  0.41831284,
        2.05626465,  0.45354621,  0.73295196,  0.20261777])

In [136]:
data_h=pd.Series(np.random.randn(9)*5,
                 index=[['a','a','a','b','b','c','c','d','d'],
                        [1,2,3,1,3,1,2,2,3]])   #Multi Index
data_h

a  1    9.931317
   2    2.483970
   3   -4.713741
b  1    9.404887
   3    0.446555
c  1   -1.351820
   2   -4.659028
d  2    4.667924
   3   -1.560864
dtype: float64

In [140]:
print(data_h)
data_h.index

a  1    9.931317
   2    2.483970
   3   -4.713741
b  1    9.404887
   3    0.446555
c  1   -1.351820
   2   -4.659028
d  2    4.667924
   3   -1.560864
dtype: float64

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

# With hierarchial indexing, subsets of data can be selected concisely:

In [141]:
data_h.loc[['d','a']]

a  1    9.931317
   2    2.483970
   3   -4.713741
d  2    4.667924
   3   -1.560864
dtype: float64

In [198]:
print(data_h)
data_h.loc[:,3]

a  1    9.931317
   2    2.483970
   3   -4.713741
b  1    9.404887
   3    0.446555
c  1   -1.351820
   2   -4.659028
d  2    4.667924
   3   -1.560864
dtype: float64

a   -4.713741
b    0.446555
d   -1.560864
dtype: float64

In [205]:
data_h[['b','c']]

b  1    9.404887
   3    0.446555
c  1   -1.351820
   2   -4.659028
dtype: float64

In [206]:
data_h['b':'c']

b  1    9.404887
   3    0.446555
c  1   -1.351820
   2   -4.659028
dtype: float64

# Hierarchial data can be converted into dataframe by using : unstack

In [150]:
data_h.unstack()

          1         2         3
a  9.931317  2.483970 -4.713741
b  9.404887       NaN  0.446555
c -1.351820 -4.659028       NaN
d       NaN  4.667924 -1.560864

In [151]:
data_h.unstack().stack()

a  1    9.931317
   2    2.483970
   3   -4.713741
b  1    9.404887
   3    0.446555
c  1   -1.351820
   2   -4.659028
d  2    4.667924
   3   -1.560864
dtype: float64

# In DataFrame: With DataFrame either axis can have a hierarchical index

In [207]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
                   index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['ohio','ohio','colorado'],['Green','Red','Green']])
frame

     ohio     colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [208]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
frame['ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [35]:
frame['colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [157]:
frame

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [158]:
frame.swaplevel('key1','key2') 
# swaplevel takes two numbers or name and returns a new object with 
# level interchanged

state      ohio     colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [210]:
frame.sort_index(level=0)

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [39]:
frame.sort_index(level=1)

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [211]:
print(frame)
frame.swaplevel(0,1).sort_index(level=0)

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state      ohio     colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

# Summery Statistics by level

In [215]:
#print(frame)
frame.sum(level='key2')

state  ohio     colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [216]:
#print(frame)
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [171]:
#frame.sum(level='state',axis=1)

# Indexing with a DataFrame's columns:
We can use one or more columns as  row index OR we may wish to move the row index into the DataFrame's columns.

In [172]:
frame1=pd.DataFrame({'a':range(7),'b':range(7,0,-1),
                     'c':['one','one','one','two','two','two','two'],
                     'd':[0,1,2,0,1,2,3]})
frame1

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [173]:
frame2=frame1.set_index(['c','d'])       # columns are droped here
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [174]:
frame2.reset_index()                     ## opposite of : .set_index():  .reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [175]:
frame2=frame1.set_index(['c','d'],drop=False)       ## by default the columns are dropped, we can keep it: drop=False
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

# Concatenating along an axis
   #### Series

##### Note: concatenating arguments: axis , join, join_axes, keys,levels, names, ignore_index

In [177]:
import pandas as pd
import numpy as np

In [178]:
s1=pd.Series([0,1],index=['a','b'])
s2=pd.Series([2,3,4],index=['c','d','e'])
s3=pd.Series([5,6],index=['f','g'])

In [179]:
s1

a    0
b    1
dtype: int64

In [180]:
s2

c    2
d    3
e    4
dtype: int64

In [181]:
s3

f    5
g    6
dtype: int64

In [182]:
pd.concat([s1,s2,s3],axis=1)            # by default concat acts along axis=0, axis=1 can be passed

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [186]:
pd.concat([s1,s2,s3],axis=1,sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [184]:
s11=pd.Series([0,1],index=['a','b'])
s22=pd.Series([2,3,4],index=['a','b','c'])
s33=pd.Series([5,6],index=['a','b'])

In [185]:
pd.concat([s11,s22,s33],axis=1,sort=True)

     0  1    2
a  0.0  2  5.0
b  1.0  3  6.0
c  NaN  4  NaN

In [57]:
s4=pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [58]:
s1

a    0
b    1
dtype: int64

In [59]:
pd.concat([s1,s4],axis=1,sort=True) ## by default it is intersection, for uion pass :> join='inner'

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [60]:
pd.concat([s1,s4],axis=1,join='inner',sort=True) ## intersection thus: f,g disappeared

   0  1
a  0  0
b  1  1

In [61]:
# We can even specify the axes to be used on the other axes with :> join_axes=[[...]]
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']],sort=True )

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [62]:
# To identify the concatenated pieces, use keys argument as below:
result=pd.concat([s1,s2,s3],keys=['one','two','three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [63]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [64]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'],sort=True)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

#### DataFrame: 
###### Same logic is extended in DataFrame as .

In [65]:
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])
df2=pd.DataFrame(np.arange(4).reshape(2,2),index=['a','b'],columns=['three','four'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [66]:
df2

   three  four
a      0     1
b      2     3

In [67]:
pd.concat([df1,df2],keys=['level1','level2'],sort=False)##By default axis=0 is taken

          one  two  three  four
level1 a  0.0  1.0    NaN   NaN
       b  2.0  3.0    NaN   NaN
       c  4.0  5.0    NaN   NaN
level2 a  NaN  NaN    0.0   1.0
       b  NaN  NaN    2.0   3.0

In [68]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    2.0  3.0
c      4   5    NaN  NaN

In [69]:
# above same thing can be done like this as well:
pd.concat({'level1':df1,'level2':df2},axis=1,sort=True)

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    2.0  3.0
c      4   5    NaN  NaN

In [70]:
# Hierarchial indexing is also possible with concatanting: with 'names' argument
pd.concat([df1,df2],keys=['level1','level2'],names=['upper','lower'],axis=1,sort=False)

upper level1     level2
lower    one two  three four
a          0   1    0.0  1.0
b          2   3    2.0  3.0
c          4   5    NaN  NaN

In [71]:
# when there is no relevant information in index then we can drop it by :>  ignore_index=True
# and a new index is created:
dff1=pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
dff2=pd.DataFrame(np.random.randn(2,3),columns=['b','d','a'])
dff1

          a         b         c         d
0 -0.306346 -0.477117 -0.562777 -0.174749
1  0.582685  0.836071  0.246023 -0.966054
2 -1.003906 -0.231296  0.715519 -0.364832

In [72]:
dff2

          b         d         a
0 -0.941236  0.450966  1.149728
1  0.292153  0.966276 -1.065325

In [73]:
pd.concat([dff1,dff2],sort=True)

          a         b         c         d
0 -0.306346 -0.477117 -0.562777 -0.174749
1  0.582685  0.836071  0.246023 -0.966054
2 -1.003906 -0.231296  0.715519 -0.364832
0  1.149728 -0.941236       NaN  0.450966
1 -1.065325  0.292153       NaN  0.966276

In [74]:
pd.concat([df1,df2],ignore_index=True,sort=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   1.0  NaN    0.0  NaN
4   3.0  NaN    2.0  NaN

# Combining data with overlap
 We may have two dataset whose indexes overlap in full or part:

In [75]:
a=pd.Series([np.nan,3,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])
a

f    NaN
e    3.0
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [76]:
b=pd.Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [77]:
np.where(pd.isnull(a),b,a)

array([0. , 3. , 2. , 3.5, 4.5, 5. ])

Above operation can be done using method :> combine_first

In [78]:
a.combine_first(b)

f    0.0
e    3.0
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

With DataFrame same operation is done column by column,it can be think like patching missing data in the calling object
with data from the object that is  passed.

### Reshaping and pivoting
   ######  . stack ( ) : This rotates or pivots from the columns in the data to the rows  
   ###### . unstack ( ) : This pivots from the rows into the columns

In [79]:
data1=pd.DataFrame(np.arange(6).reshape((2,3)),index=pd.Index(['ohio','colorado',],name='state'),
                   columns=pd.Index(['one','two','three'],name='number'))
data1

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [80]:
data1.stack()

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [81]:
result=data1.stack('number')
result ## here result became hierarchial indexing type

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [82]:
result.unstack() ## by defautl innermost level is unstacked( Here: state is outer and number is inner)

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [83]:
result.unstack('number')

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [84]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [85]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

Note: unstacking might introduce missing data if all of the values in the level aren't found in each of the subgroup

In [86]:
import pandas as pd
import numpy as np
s1=pd.Series([0,1,2,3],index=['a','b','c','d'])
s2=pd.Series([4,5,6],index=['c','d','e'])
data2=pd.concat([s1,s2],keys=['one','two'],axis=0,sort=True)
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [87]:
result1=data2.unstack()
result1

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [188]:
## stack automatically removes NaN, To keep NaN, pass : dropna=False
# Pandas dropna() method allows the user to analyze and drop Rows/Columns with Null values in different ways.

result1.stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [89]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [90]:
dff=pd.DataFrame({'left':result,'right':result+5},columns=pd.Index(['left','right'],name='side'))
dff

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [91]:
dff.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [92]:
dff.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

# . pivot ( )   : long to wide table

In [93]:
dt=pd.read_csv('macrodata.csv')
dt.head()

FileNotFoundError: [Errno 2] File b'macrodata.csv' does not exist: b'macrodata.csv'

In [ ]:
periods=pd.PeriodIndex(year=dt.year,quarter=dt.quarter,name='date')
columns=pd.Index(['realgdp','infl','unemp'],name='item')
dt=dt.reindex(columns=columns)
dt.index=periods.to_timestamp('D','end')
ldata=dt.stack().reset_index().rename(columns={0:'value'})
ldata.head() ### long format of table

In [ ]:
ldata['value2']=np.random.randn(len(ldata))
ldata[:10]

In [ ]:
pivoted=ldata.pivot('date','item','value')
pivoted # wide format of table

In [ ]:
pivoted1=ldata.pivot('date','item')
pivoted1[:10]

# . melt ( ) :  Wide to long

In [ ]:
dff1=pd.DataFrame({'key':['foo','bar','baz'],'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})
dff1

In [ ]:
melt_df=pd.melt(dff1,['key'])
melt_df